
int nLEDpin[] ={2,3,4,5,6,7,8,9};  // 7세그먼트 a~g & DP LED에 연결될 핀을 지정한다. 

// 각 16진수 숫자 0~f 에 대한 LED 값을 정의한다.
// 숫자에 대응되는 LED 값을 HIGH (1)로 설정한다.
int nHexNum[17][8] ={
{1,1,1,1,1,1,0,0},       // 0
{0,1,1,0,0,0,0,0},       // 1
{1,1,0,1,1,0,1,0},       // 2
{1,1,1,1,0,0,1,0},       // 3
{0,1,1,0,0,1,1,0},       // 4
{1,0,1,1,0,1,1,0},       // 5
{1,0,1,1,1,1,1,0},       // 6
{1,1,1,0,0,0,0,0},       // 7
{1,1,1,1,1,1,1,0},       // 8
{1,1,1,1,0,1,1,0},       // 9
{1,1,1,0,1,1,1,0},       // a
{0,0,1,1,1,1,1,0},       // b
{1,0,0,1,1,1,0,0},       // c
{0,1,1,1,1,0,1,0},       // d
{1,0,0,1,1,1,1,0},       // e
{1,0,0,0,1,1,1,0}        // f
{0,0,0,0,0,0,0,1}        // dot (점)
};


void setup() {
                    
  for(int i =0 ; i <8 ; i++){                 // 7 세그먼트LED의 8개의핀을
     pinMode(nLEDpin[i], OUTPUT);             // 출력으로 설정
  }
}


void loop() {

  for(int i =0 ; i <17 ; i++){             // 숫자 0부터 점까지
  
    for(int j =0 ; j <8 ; j++){                // 8개의 LED를
    
      digitalWrite(nLEDpin[j],nHexNum[i][j]);     // 정해진 배열대로 켜고 끈다.
    }
   
    delay(1000);                          // 1초에 한 번씩 숫자가 바뀐다
  }


